INSERT INTO Account_Password
VALUES('14589845','SDJF1234'),
('252453654','RTYU9151'),
('27255458','SO8234-+'),
('12518555','PFOG78146+'),
('4548342','DSSD7851'),
('1543562','POIU0303'),
('97589845','098QWER'),
('91854645','Q9Q9WE7'),
('47589845','FD5FFDSF'),
('55589845','V1V44V4'),
('1','1')

INSERT INTO LABEL
values('流行'),
('摇滚'),
('古典音乐'),
('说唱'),
('纯音乐'),
('民谣'),
('轻音乐')

INSERT INTO [USERINFO]
VALUES(1,'红茶honer','1','这个人很懒，什么也没留下。','2000-09-09','0',1),
(2,'biki797','1','我都想笑了','2005-04-29','1',2),
(3,'一月序','1','小卡什么都不知道。','1988-12-14','1',3),
(4,'cat414','2','光风霁月','2002-04-15','1',2),
(5,'如果冬天来临','2','随心所欲','2004-02-19','0',3),
(6,'独身的短尾猫','2','去做个心动的梦吧','1999-11-04','0',7),
(7,'whoooooaa','1','凌郡请与我交往','1974-05-24','0',5),
(8,'十三的三十三','1','想吃火锅','2007-06-07','1',7),
(9,'一个兔叽','2','走夜路请放声歌唱。','2002-03-23','1',4),
(10,'我真的不熬夜了','1','这个人很神秘，什么也没留下。','2000-09-30','1',6),
(11,'用户已注销','1','该用户已注销','2022-11-24','1',1)

INSERT INTO MUSIC
VALUES('倔强',261,'2004-11-05','0',1),
('月亮代表我的心',208,'1973-12-01','0',1),
('郊眠寺',580,'2020-12-22','0',2),
('白兰鸽巡游记',316,'2014-10-21','0',6),
('如果当时',316,'2009-01-10','0',1),
('曲率飞行',337,'2018-05-01','0',6),
('玫瑰往事',355,'2019-01-18','0',7),
('安静的美好',234,'2017-06-07','0',7),
('逝去的歌',294,'2015-10-04','0',1),
('路过人间',288,'2021-10-22','0',1)


INSERT INTO MUSICMAKER
VALUES('五月天'),
('邓丽君'),
('万能青年旅店'),
('丢火车'),
('许嵩'),
('昨夜派对'),
('康士坦的变化球'),
('旅行团乐队'),
('郁可唯')

INSERT INTO SHEET
VALUES('[听·五月天] 人生海海，总有人陪你听五月天','1997年成立至今，五月天早已是乐迷的心中划时代的乐团，也早就可以让五迷们自豪地喊出五月天是全中国乃至整个亚洲最具代表性和影响力的乐团。在唱片时代惊人的销量，让华语音乐开启乐团的时代。',814),
('今天从《寻人启事》听起|私人雷达','你爱的歌，值得反复聆听',3292),
('浪漫摇滚 | 独立音乐的终极浪漫美学','音乐是一种永恒的浪漫，体验一下摇滚新感觉，原来摇滚也可以这么浪漫。',70),
('[听·王菲] 幻乐一场，如歌如梦','自1989年以“王靖雯”之名在香港乐坛出道，至2003年发表《将爱》，王菲在世纪之交开创了辉煌的个人时代。特立独行的她，无论曲风、造型亦或唱腔，都另辟蹊径地引领着潮流。音乐类型上也是繁花似锦，复古与前卫并行，从欧洲音乐的古典韵味，到掷地有声的摇滚与迷幻电音，甚至咏叹与佛诵，她屡屡创新，留下了让时代难忘的华丽声音。而若即若离、唱游人间的洒脱姿态，更是最为人称道的一抹传奇色彩。',458),
('[台湾新发现] 傻子与白痴上线新歌','来自中国台湾歌手的最新&冷门作品',7725),
('[夏日摇滚] 漫漫夏月夜 微风吹来清凉的旋律','如果我们需要一些为这个夏天的降温的东西，这里有凉风、有星夜、有蝉鸣。如果我们还想去一些更远的地方，这里是海岸、是森林、是月亮。漫漫夏夜，我们一起走吧',112),
('[宝贝的摇篮曲] 纯音乐陪伴宝贝进入甜美梦乡','美妙安静的纯音乐,给宝宝一整晚的好眠',1483),
('写作业时能集中注意力的纯音乐','治愈我的伤',3715)

INSERT INTO [COMMENT]
VALUES('海绵宝宝我们去抓水母吧 对不起，派大星，今天我要去上课，不能陪你去抓水母了 '),
('只是越看见海阔天空，越遗憾没有你分享我的感动。'),
('再坚强一点，加油'),
('因为蝴蝶那晚捎来的消息绝非偶然 '),
('希望聽到的大家都會很幸福 '),
('我宣布这首在我心里最佳 '),
('大家纷纷打开了剪切板 复制进早已想了很久的文案'),
('忍痛花了22元……我要天天听听回本'),
('虽然这一切终会流逝的'),
('新砖很好听 但这首真是神了')

INSERT INTO ALBUM
VALUES('世界'),
('无尽美丽的事物'),
('更迭'),
('阿菲正传'),
('冀西南路林行'),
('短篇与玫瑰的八毫米'),
('无人知晓'),
('寻人启事'),
('LOVELY SUNDAY'),
('依然')

INSERT INTO MID_MMID
VALUES
(1,1),
(2,2),
(3,3),
(4,4),
(5,5),
(6,6),
(7,6),
(8,7),
(9,8),
(10,9)

INSERT INTO MID_AID
VALUES
(1,1),
(2,2),
(3,3),
(4,4),
(5,5),
(6,6),
(7,7),
(8,8),
(9,9),
(10,10)

INSERT INTO SID_MID
VALUES
(1,1),
(1,2),
(2,2),
(2,3),
(3,3),
(3,4),
(4,4),
(4,5),
(5,5),
(5,6),
(6,6),
(6,7),
(7,7),
(7,8),
(8,8),
(8,9),
(8,10)

INSERT INTO UID_SID_Create
VALUES
(1,1),
(2,2),
(3,3),
(4,4),
(5,5),
(6,6),
(7,7),
(8,8)

INSERT INTO UID_SID_Favor
VALUES
(1,2),
(2,3),
(3,4),
(4,5),
(5,6),
(6,7),
(7,8),
(8,1)

INSERT INTO UID_CID
VALUES
(1,1),
(2,2),
(3,3),
(4,4),
(5,5),
(6,6),
(7,7),
(8,8),
(9,9),
(10,10)

INSERT INTO MID_CID
VALUES
(1,1),
(2,2),
(3,3),
(4,4),
(5,5),
(6,6),
(7,7),
(8,8),
(9,9),
(10,10)

update Music set MDir = 'music/月亮代表我的心-邓丽君 .mp3' where MName = '月亮代表我的心'
update Music set MDir = 'music/倔强.mp3' where MName = '倔强'
update Music set MDir = 'music/如果当时.mp3' where MName = '如果当时'
update Music set MDir = 'music/安静的美好.mp3' where MName = '安静的美好'
update Music set MDir = 'music/曲率飞行.mp3' where MName = '曲率飞行'
update Music set MDir = 'music/玫瑰往事.mp3' where MName = '玫瑰往事'
update Music set MDir = 'music/白兰鸽巡游记.mp3' where MName = '白兰鸽巡游记'
update Music set MDir = 'music/路过人间.mp3' where MName = '路过人间'
update Music set MDir = 'music/逝去的歌.mp3' where MName = '逝去的歌'
update Music set MDir = 'music/郊眠寺.mp3' where MName = '郊眠寺'
